# Pandas

## Imports

In [1]:
# Built in libs
import time
import os 
import os.path
import sys
import datetime

# Standard libs
import pandas as pd
import numpy as np
import re

# SQLite DB
import sqlite3
import sqlalchemy

## To display errors

In [3]:
def PrintException():
    exc_type, exc_obj, tb = sys.exc_info()
    f = tb.tb_frame
    lineno = tb.tb_lineno
    filename = f.f_code.co_filename
    linecache.checkcache(filename)
    line = linecache.getline(filename, lineno, f.f_globals)
    print('EXCEPTION IN ({}, LINE {} "{}"): {}'.format(filename, lineno, line.strip(), exc_obj))
    
try:
    # YOUR CODE...
    print(1/0)
except:
    PrintException()

EXCEPTION IN (<ipython-input-3-e0e041af377c>, LINE 12 "print(1/0)"): division by zero

## Reading data from db

In [ ]:
def from_db(conn, table):
    return pd.read_sql('SELECT * FROM ' + table, con=conn)

connection = sqlite3.connect('Data/DB_Name.sqlite')
cur = connection.cursor()

# Reading a table from DB & storing it in a Dataframe
Data_frame = from_db(connection, 'TABLE_NAME')

## Creating a database

In [ ]:
# Create a DB
conn = sqlite3.connect('Data/NEW_DB_NAME.sqlite')
cur = conn.cursor()
cur.execute('CREATE TABLE IF NOT EXISTS Processed (TimeReceived VARCHAR(100))')

# Create a table inside DB
try:
    Data_frame.to_sql(name="TABLE_NAME", con=conn, if_exists="replace", index=False) 
except Exception as e:
    print "Normal insertion failed, hence inserting everything as VARCHAR/TEXT!"
    for col in dataframe:
        dataframe[col] = dataframe[col].apply(lambda x: x.encode('ascii', 'ignore') if type(x) == unicode else x).astype(str)
    Data_frame.to_sql(name="TABLE_NAME", con=conn, if_exists="replace", index=False)

## Date time

1. pd.to_datetime(string/series) - Convert anything to Timestamp, if format is not known
2. strftime - Convert datetime to any desired format
3. strptime - Convert str to exact same format datetime

In [6]:
## Current datetime
print(datetime.datetime.now())

2018-08-07 11:23:40.349326

### Convert any format to timestamp

In [8]:
time_1 = '1/31/2018 3:15'                                   # pd.to_datetime()
time_2 = '02-08-18 16:15'                                   # pd.to_datetime()
time_3 = np.datetime64('2018-02-21T06:45:00.000000000')     # pd.to_datetime()
time_4 = 1485880006                                         # datetime.datetime.fromtimestamp()

# Conversions Required...
print(pd.to_datetime(time_1))
print(pd.to_datetime(time_2))
print(pd.to_datetime(time_3))
print(datetime.datetime.fromtimestamp(time_4))

2018-01-31 03:15:00
2018-02-08 16:15:00
2018-02-21 06:45:00
2017-01-31 21:56:46

In [9]:
print(time.strftime("%d-%m-%Y %H:%M:%S"))
print(time.strftime("%d/%m/%Y %H:%M:%S"))
print(time.strftime("%Y-%m-%d %H:%M:%S"))

07-08-2018 11:26:18
07/08/2018 11:26:18
2018-08-07 11:26:18

## List Comprehension

In [11]:
a_list = [1,2,3]
without_list_comprehend = []

for i in a_list:
    for j in a_list:
        without_list_comprehend.append(i+j)

print(without_list_comprehend)

[2, 3, 4, 3, 4, 5, 4, 5, 6]

In [12]:
list_comprehend = [i+j for j in a_list for i in a_list]
print(list_comprehend)

[2, 3, 4, 3, 4, 5, 4, 5, 6]

### only if

In [13]:
[i for i in a_list if i%2==0]

[2]

### if-else

In [16]:
['EVEN' if i%2==0 else 'ODD' for i in a_list]

['ODD', 'EVEN', 'ODD']

### Lambda Function

In [ ]:
dff['Col_1'] = dff['Col_1'].apply(lambda x: <exp(x)> )
******************************************************
def function(x):
    <exp>
    return <exp>

dff['Col_1'] = dff['Col_1'].apply(function)

## NAN Value Handling

In [ ]:
### Frequency of NAN
Data_frame.isnull().sum()

### Dataframe storing only NAN Rows
Data_frame = Data_frame[Data_frame['COL_NAME'].isnull() == True]

### Dataframe storing Not NAN Rows
Data_frame = Data_frame[Data_frame['COL_NAME'].notnull() == True]

### Dropping NAN from entire df
Data_frame.dropna().reset_index(drop=True)

### Dropping NAN from Particular Columns
Data_frame.dropna( subset = ['Col_1', 'Col_2'] ).reset_index(drop=True)

### Fill with Random Value
Data_frame['Column_Name'].fillna('B')

### Fill with Some Column Values
Data_frame['Column_Name'].fillna(df.col2, inplace=True)

## DF

In [ ]:
### Renaming column name
df.columns = ['List of new column names']

### Adding suffix to every column
df = df.add_suffix('X')

### Re-indexing column order
df.reindex(columns = ['Col4', 'Col1', 'Col2', 'Col3'])

## SUM

In [19]:
df = pd.DataFrame({'':[0.87569, 0.8723823, 0.821212],
                    'TimeReceived':['2017-09-29 12:00:00', '2017-09-29 12:00:00', '2017-09-29 12:00:00'],
                    'UniqueId':['1-1-1', '1-1-1', '1-1-1'],
                    'V1':[1, np.nan, 2, ],
                    'V2':[np.nan, np.nan, 10],
                  })
df

                    TimeReceived UniqueId   V1    V2
0  0.875690  2017-09-29 12:00:00    1-1-1  1.0   NaN
1  0.872382  2017-09-29 12:00:00    1-1-1  NaN   NaN
2  0.821212  2017-09-29 12:00:00    1-1-1  2.0  10.0

### Sum of all values across entire row

In [20]:
df['SUM_of_integers_Only'] = df.sum(axis=1)
df

                    TimeReceived UniqueId   V1    V2  SUM_of_integers_Only
0  0.875690  2017-09-29 12:00:00    1-1-1  1.0   NaN              1.875690
1  0.872382  2017-09-29 12:00:00    1-1-1  NaN   NaN              0.872382
2  0.821212  2017-09-29 12:00:00    1-1-1  2.0  10.0             12.821212

## Unicode Handling

In [ ]:
df['Column_name'] = df['Column_name'].apply(lambda x: x.enocde('ascii', 'ignore') if type(x) == unicode else x)

## Directory and File Operations

In [26]:
### Opening a File
Path =  'E:\ML Training PPT'

files = []
for f in os.listdir(Path):
    print('Loading ' + f)

Loading .ipynb_checkpoints
Loading 1.0-BasicPython
Loading 1.0-PythonNumpy
Loading 1.1-MovieDataExploration
Loading Capstone Project-Final.pptx
Loading Capstone Project.pptx
Loading debug.log
Loading Pandas.ipynb
Loading Stackroute
Loading starterbot

In [27]:
### Get current Path
parent_path = os.getcwd()
parent_path

'E:\\ML Training PPT'

In [ ]:
### Make single folder
os.mkdir('New_folder')

### Multiple sub-dirs
os.makedirs('New_folder\inside_folder\still_inside_folders\')
            
### Rename a folder
os.rename('New_folder', 'New_folder_OLD')
            
### Remove a folder
shutil.rmtree('New_folder_OLD')

### List all folders
os.listdir(os.getcwd())
            
### current folder: where the python file resides# curre 
os.path.isdir(os.getcwd())

### TO check for a Folder..
os.path.isdir('Data sets\Some_dir')
            
### TO check for a file..
os.path.exists('Data sets\Some_file.xlsx')

### Check if any file exits in a folder or it is empty
for dir, sub_dirs, files in os.walk('Data'):
    if not files:
        print('No files. The folder is empty!')

In [ ]:
### Snippet to create/remove/rename a folder
if not os.path.exists('Exported Data'):
    os.mkdir('Exported Data')
else:
    os.rename('Exported Data', 'Exported Data_OLD')
    os.mkdir('Exported Data')
    
--------
#  OR  #
--------
    
if not os.path.isdir('db'):
    os.mkdir('db')
else:
    shutil.rmtree('db')

### Copy folder/file

In [ ]:
###  Won't delete the existing folder and will add new files in it. For even same file-names, it will overwrite it.# Won't 
distutils.dir_util.copy_tree('C:\Users\Username\Desktop\src', 'C:\Users\Username\Desktop\dest')

### First remove the existing folder & then this can copy.
shutil.rmtree('C:\Users\Username\Desktop\dest')
shutil.copytree('C:\Users\Username\Desktop\src', 'C:\Users\Username\Desktop\dest')

## Merging, Joining, and Concatenating

In [29]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7]) 
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [30]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [31]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [32]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

### Concatenation basically glues together DataFrames. Keep in mind that dimensions should match along the axis you are concatenating on. You can use pd.concat and pass in a list of DataFrames to concatenate together:

In [33]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [34]:
pd.concat([df1,df2,df3],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

### The merge function allows you to merge DataFrames together using a similar logic as merging SQL Tables together. For example:

In [35]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [36]:
left

    A   B key
0  A0  B0  K0
1  A1  B1  K1
2  A2  B2  K2
3  A3  B3  K3

In [37]:
right

    C   D key
0  C0  D0  K0
1  C1  D1  K1
2  C2  D2  K2
3  C3  D3  K3

In [38]:
pd.merge(left,right,how='inner',on='key')

    A   B key   C   D
0  A0  B0  K0  C0  D0
1  A1  B1  K1  C1  D1
2  A2  B2  K2  C2  D2
3  A3  B3  K3  C3  D3

In [39]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [40]:
left

    A   B key1 key2
0  A0  B0   K0   K0
1  A1  B1   K0   K1
2  A2  B2   K1   K0
3  A3  B3   K2   K1

In [41]:
right

    C   D key1 key2
0  C0  D0   K0   K0
1  C1  D1   K1   K0
2  C2  D2   K1   K0
3  C3  D3   K2   K0

In [42]:
pd.merge(left, right, on=['key1', 'key2'])

    A   B key1 key2   C   D
0  A0  B0   K0   K0  C0  D0
1  A2  B2   K1   K0  C1  D1
2  A2  B2   K1   K0  C2  D2

In [43]:
pd.merge(left, right, how='outer', on=['key1', 'key2'])

     A    B key1 key2    C    D
0   A0   B0   K0   K0   C0   D0
1   A1   B1   K0   K1  NaN  NaN
2   A2   B2   K1   K0   C1   D1
3   A2   B2   K1   K0   C2   D2
4   A3   B3   K2   K1  NaN  NaN
5  NaN  NaN   K2   K0   C3   D3

In [44]:
pd.merge(left, right, how='right', on=['key1', 'key2'])

     A    B key1 key2   C   D
0   A0   B0   K0   K0  C0  D0
1   A2   B2   K1   K0  C1  D1
2   A2   B2   K1   K0  C2  D2
3  NaN  NaN   K2   K0  C3  D3

In [45]:
pd.merge(left, right, how='left', on=['key1', 'key2'])

    A   B key1 key2    C    D
0  A0  B0   K0   K0   C0   D0
1  A1  B1   K0   K1  NaN  NaN
2  A2  B2   K1   K0   C1   D1
3  A2  B2   K1   K0   C2   D2
4  A3  B3   K2   K1  NaN  NaN

### Joining is a convenient method for combining the columns of two potentially differently-indexed DataFrames into a single result DataFrame.

In [46]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [47]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [48]:
left.join(right, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

## Operations

In [ ]:
### Create a new column
df['new_col'] = df['old1'] + df['old2']

### Remove a column
df.drop('new_col',axis=1,inplace=True)

### Drop a row
df.drop('row',axis=0)

### Selecting Row
df.loc['row1']

### Select row based of position
df.iloc[2]

### selecting subset of rows and columns
df.loc['row','column']
df.loc[['row3','col2'],['row5','col2']]

### conditional Selection
df[df['col']>0]

### Reset to default 0,1...n index
df.reset_index()

## groupBy

In [49]:
df = pd.DataFrame({'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]})

In [52]:
df.groupby('Company').mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [53]:
df.describe()

            Sales
count    6.000000
mean   229.500000
std    100.899455
min    120.000000
25%    143.000000
50%    221.500000
75%    315.750000
max    350.000000

In [55]:
df['Sales'].unique()

array([200, 120, 340, 124, 243, 350], dtype=int64)

In [56]:
df['Sales'].nunique()

6

## Pivot Table

In [57]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [58]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [59]:
df.pivot_table(values='D',index=['A', 'B'],columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN